app/views/items/index.html.erb

SELECT `orders`.* FROM `orders` WHERE `orders`.`item_id` = 8 LIMIT 1
---
          <%# 商品が売れていればsold outを表示しましょう %>
          <% if  item.order != nil %>