app/views/items/show.html.erb

SELECT `orders`.* FROM `orders` WHERE `orders`.`item_id` = 8 LIMIT 1
---
      <%# 商品が売れている場合は、sold outを表示しましょう %>
     <% if  @item.order != nil %>