app/controllers/items_controller.rb

   def index
     @items = Item.all.order("created_at DESC")
---
SELECT `items`.* FROM `items` ORDER BY created_at DESC

  def create
    @item = Item.new(item_params)
    if @item.save
---
INSERT INTO `items` (`item_name`, `category_id`, `price`, `user_id`, `description`, `status_id`, `burden_id`, `area_id`, `shipment_id`, `created_at`, `updated_at`) VALUES ('カメラ', 2, 300, 5, 'カメラ', 2, 2, 2, 2, '2020-10-23 04:38:26.033558', '2020-10-23 04:38:26.033558')

  def update
    @item.update(item_params)
---
UPDATE `items` SET `items`.`category_id` = 4, `items`.`updated_at` = '2020-10-19 12:07:05.171293' WHERE `items`.`id` = 9

  def Item_find
    @item = Item.find(params[:id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 9 LIMIT 1