app/controllers/orders_controller.rb

  def index
    @item = Item.find(params[:item_id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 8 LIMIT 1

  def create
    @item = Item.find(params[:item_id])
---
SELECT `items`.* FROM `items` WHERE `items`.`id` = 8 LIMIT 1