app/controllers/orders_controller.rb

SELECT `orders`.* FROM `orders` WHERE `orders`.`item_id` = 11 LIMIT 1
---
  def index
    @user_order = UserOrder.new
    if current_user.id == @item.user_id || @item.order != nil

INSERT INTO `orders` (`item_id`, `user_id`, `created_at`, `updated_at`) VALUES (8, 5, '2020-10-22 10:31:56.264009', '2020-10-22 10:31:56.264009')
---
  def create
    @user_order = UserOrder.new(order_address_params)
    if @user_order.valid?
      pay_item
      @user_order.save

SELECT `items`.* FROM `items` WHERE `items`.`id` = 11 LIMIT 1
---
  def Item_find
    @item = Item.find(params[:item_id])