app/models/user_order.rb

INSERT INTO `orders` (`item_id`, `user_id`, `created_at`, `updated_at`) VALUES (7, 5, '2020-10-23 03:23:09.300679', '2020-10-23 03:23:09.300679')
---
        def save
          Address.create(postal_code: postal_code, prefecture_id: prefecture_id, municipality: municipality, address: address, building: building,user_id: user.id)
          Order.create(item_id: item_id, user_id: user.id, token: token)